app/controllers/coaches_controller.rb

	def show
		@coach = Coach.find(params[:id])
---
SELECT  "coaches".* FROM "coaches" WHERE "coaches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]