app/controllers/diet_menu_controller.rb

	def show
		@user = User.find(params[:id])
		@active_diet_search = UserEatDiet.where(
			'user_id = :id and finished = 0 and exp_date >= :today',
			:id => @user.id,
			:today => Time.now
			)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "user_eat_diets".* FROM "user_eat_diets" WHERE (user_id = 1 and finished = 0 and exp_date >= '2017-10-22 19:25:08.902699')