app/controllers/people_controller.rb

  def create
  	@person = Person.new(person_params)
  	#debugger

  	if @person.save
      @user = User.new(person_id: @person.id)
      @user.save
---
INSERT INTO "users" ("person_id", "level", "points", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["person_id", 82290336], ["level", 0], ["points", 0], ["created_at", "2017-10-09 04:15:42.778717"], ["updated_at", "2017-10-09 04:15:42.778717"]]