app/controllers/users_controller.rb

  def update
		@user = User.find(params[:id])
 		if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "character" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["character", "public/images/profile/teste4.png"], ["updated_at", "2017-10-18 19:18:17.186075"], ["id", 1]]